<a href="https://colab.research.google.com/github/HusanJalilov/AI_Jpyuter_/blob/main/pandas/Index_qayta_ishlash.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [18]:
import pandas as pd
data={
    'Yil':[2010,2016,2017,2018,2019,2020,2021],
    'Detilar':[230,124,678,89,45,890,345],
    'Kadetlar':[230,321,333,567,345,876,348],
    'Yunyorlar':[100,32,144,788,334,80,567],
    'Vuzroznilar':[12,44,76,34,99,46,9]
}
df=pd.DataFrame(data)
df

    Yil  Detilar  Kadetlar  Yunyorlar  Vuzroznilar
0  2010      230       230        100           12
1  2016      124       321         32           44
2  2017      678       333        144           76
3  2018       89       567        788           34
4  2019       45       345        334           99
5  2020      890       876         80           46
6  2021      345       348        567            9

In [19]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [20]:
df.columns

Index(['Yil', 'Detilar', 'Kadetlar', 'Yunyorlar', 'Vuzroznilar'], dtype='object')

In [24]:
data2=[10,16,17,18,19,20,21]
data2.sort()
data2

[10, 16, 17, 18, 19, 20, 21]

In [28]:
df.index=[10, 16, 17, 18, 19, 20, 21]
df

     Yil  Detilar  Kadetlar  Yunyorlar  Vuzroznilar
10  2010      230       230        100           12
16  2016      124       321         32           44
17  2017      678       333        144           76
18  2018       89       567        788           34
19  2019       45       345        334           99
20  2020      890       876         80           46
21  2021      345       348        567            9

In [29]:
df.reindex(data2)

     Yil  Detilar  Kadetlar  Yunyorlar  Vuzroznilar
10  2010      230       230        100           12
16  2016      124       321         32           44
17  2017      678       333        144           76
18  2018       89       567        788           34
19  2019       45       345        334           99
20  2020      890       876         80           46
21  2021      345       348        567            9

In [40]:
df.reindex(index=range(12,20), method='nearest')

     Yil  Detilar  Kadetlar  Yunyorlar  Vuzroznilar
12  2010      230       230        100           12
13  2016      124       321         32           44
14  2016      124       321         32           44
15  2016      124       321         32           44
16  2016      124       321         32           44
17  2017      678       333        144           76
18  2018       89       567        788           34
19  2019       45       345        334           99

In [42]:
df.reindex(columns=['Detilar','Kadetlar','Yunyorlar','Vuzroznilar'])

    Detilar  Kadetlar  Yunyorlar  Vuzroznilar
10      230       230        100           12
16      124       321         32           44
17      678       333        144           76
18       89       567        788           34
19       45       345        334           99
20      890       876         80           46
21      345       348        567            9

In [46]:
df.sample(7)

     Yil  Detilar  Kadetlar  Yunyorlar  Vuzroznilar
16  2016      124       321         32           44
19  2019       45       345        334           99
21  2021      345       348        567            9
18  2018       89       567        788           34
17  2017      678       333        144           76
10  2010      230       230        100           12
20  2020      890       876         80           46

In [47]:
df

     Yil  Detilar  Kadetlar  Yunyorlar  Vuzroznilar
10  2010      230       230        100           12
16  2016      124       321         32           44
17  2017      678       333        144           76
18  2018       89       567        788           34
19  2019       45       345        334           99
20  2020      890       876         80           46
21  2021      345       348        567            9

In [49]:
df.loc[[16,17,20],['Kadetlar','Vuzroznilar']] # qator va ustunlarni saralab chiqaruvchi metod

    Kadetlar  Vuzroznilar
16       321           44
17       333           76
20       876           46

In [50]:
df

     Yil  Detilar  Kadetlar  Yunyorlar  Vuzroznilar
10  2010      230       230        100           12
16  2016      124       321         32           44
17  2017      678       333        144           76
18  2018       89       567        788           34
19  2019       45       345        334           99
20  2020      890       876         80           46
21  2021      345       348        567            9